package ChapterTwelve.Project12_4;
// priorityQ.java
// Работа с приоритетной очередью
// Запуск программы: C>java PriorityQApp

////////////////////////////////////////////////////////////////
class PriorityQ {
    private Tree tree = new Tree();
    //-------------------------------------------------------------
    public void insert(int item) // Вставка элемента
    {
        tree.insert(item, item * 1.5);
    }

    //-------------------------------------------------------------
    public int remove()
    {
        return tree.removeMax().iData;
    }

    //-------------------------------------------------------------
    public int peekMin() // Чтение минимального элемента
    {
        return tree.peekMin().iData;
    }

    //-------------------------------------------------------------

    public int peekMax() // Чтение минимального элемента
    {
        return tree.peekMax().iData;
    }
    //-------------------------------------------------------------
    public boolean isEmpty() // true, если очередь пуста
    {
        return tree.isEmpty();
    }
    //-------------------------------------------------------------
} // Конец класса PriorityQ
////////////////////////////////////////////////////////////////
