package ChapterThirteen.Project13_2;


// linkList2.java
// Работа со связанным списком
// Запуск программы: C>java LinkList2App
////////////////////////////////////////////////////////////////
class Link
{
    public int iData; // Данные (ключ)
    public Link next; // Следующий элемент в списке
    // -------------------------------------------------------------
    public Link(int id) // Конструктор
    {
        iData = id;
    }

    // -------------------------------------------------------------
    public void displayLink() // Вывод содержимого элемента
    {
        System.out.print("{" + iData + "} ");
    }
} // Конец класса Link
////////////////////////////////////////////////////////////////
