package ChapterThirteen.Project13_5;


class StackX//Класс стека
{
    private  int size;//Размер
    private int[] st;//Массив с числами
    private int top;//Индекс верхушки

    // -----------------------------------------------------------
    public StackX(int s) // Конструктор
    {
        this.size = s;
        st = new int[size * 3]; // Создание массива(На одну позицию требуется три числа.)
        top = -1;
    }

    // -----------------------------------------------------------
    public void push(int j) // Размещение элемента в стеке
    {
        st[++top] = j;
    }

    // -----------------------------------------------------------
    public int pop() // Извлечение элемента из стека
    {
        return st[top--];
    }

    // ------------------------------------------------------------
    public int peek() // Чтение с вершины стека
    {
        return st[top];
    }
    public int peekNext() // Чтение числа ниже вершины
    {
        return st[top - 1];
    }
    public int peekSecond() // Чтение ещё на один элемент ниже(на 2 эл-та ниже от начала)
    {
        return st[top - 2];
    }

    // ------------------------------------------------------------
    public boolean isEmpty() // true, если стек пуст
    {
        return (top == -1);
    }

    // ------------------------------------------------------------
    public int getIndex(){//Этот метод сейчас возвращает индекс вершины
        return top;
    }
    // ------------------------------------------------------------
} // Конец класса StackX
////////////////////////////////////////////////////////////////

