package ChapterTwelve.Project12_3;

// priorityQ.java
// Работа с приоритетной очередью
// Запуск программы: C>java PriorityQApp

////////////////////////////////////////////////////////////////
class PriorityQ
{
    private Heap heap;
    private int maxSize;


    //-------------------------------------------------------------
    public PriorityQ(int s) // Конструктор
    {
        maxSize = s;
        heap = new Heap(maxSize);
    }

    //-------------------------------------------------------------
    public void insert(int item) // Вставка элемента
    {
        heap.insert(item);

    }

    //-------------------------------------------------------------
    public int remove() // Извлечение минимального элемента
    {
        return heap.remove().getKey();
    }

    //-------------------------------------------------------------
    public int peekMin() // Чтение минимального элемента
    {
        return heap.min();
    }

    //-------------------------------------------------------------
    public boolean isEmpty() // true, если очередь пуста
    {
        return heap.isEmpty();
    }

    //-------------------------------------------------------------
    public boolean isFull() // true, если очередь заполнена
    {
        return heap.isFull();
    }

    //-------------------------------------------------------------
} // Конец класса PriorityQ
////////////////////////////////////////////////////////////////
